MacRover/maxwell/firmware/SMRCC/elec_validation/STM32-ADC/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define NPK_DE_Pin GPIO_PIN_0
#define NPK_DE_GPIO_Port GPIOA
#define NPK_RE_Pin GPIO_PIN_1
#define NPK_RE_GPIO_Port GPIOA
#define CO2_READY_Pin GPIO_PIN_0
#define CO2_READY_GPIO_Port GPIOB
#define SPARE_1_Pin GPIO_PIN_1
#define SPARE_1_GPIO_Port GPIOB
#define LED_RED_Pin GPIO_PIN_2
#define LED_RED_GPIO_Port GPIOB
#define LINACTUATOR_3_Pin GPIO_PIN_12
#define LINACTUATOR_3_GPIO_Port GPIOB
#define LINACTUATOR_2_Pin GPIO_PIN_13
#define LINACTUATOR_2_GPIO_Port GPIOB
#define LINACTUATOR_1_Pin GPIO_PIN_14
#define LINACTUATOR_1_GPIO_Port GPIOB
#define NPK_TX_Pin GPIO_PIN_9
#define NPK_TX_GPIO_Port GPIOA
#define NPK_RX_Pin GPIO_PIN_10
#define NPK_RX_GPIO_Port GPIOA
#define J7_SWDIO_Pin GPIO_PIN_13
#define J7_SWDIO_GPIO_Port GPIOA
#define J7_SWCLK_Pin GPIO_PIN_14
#define J7_SWCLK_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
